bluebottle/funding_stripe/tests/files/intent_webhook_success.json

{
  "object": {
    "id": "pi_1Ek5PlK7fTZ9PRZUBcDlZAZj",
    "object": "payment_intent",
    "allowed_source_types": [
      "card"
    ],
    "amount": 10000,
    "amount_capturable": 0,
    "amount_received": 10000,
    "application": null,
    "application_fee_amount": null,
    "canceled_at": null,
    "cancellation_reason": null,
    "capture_method": "automatic",
    "charges": {
      "object": "list",
      "data": [
        {
          "id": "ch_1Ek5PtK7fTZ9PRZUEYBqXYLa",
          "object": "charge",
          "amount": 10000,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "application_fee_amount": null,
          "balance_transaction": "txn_1Ek5PuK7fTZ9PRZU50p2EtKN",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": "42424",
              "state": null
            },
            "email": null,
            "name": "Ernst",
            "phone": null
          },
          "captured": true,
          "created": 1560241997,
          "currency": "eur",
          "customer": null,
          "description": null,
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {
          },
          "invoice": null,
          "livemode": false,
          "metadata": {
            "tenant_domain": "goodup-demo.localhost",
            "activity_title": "iyughyiugiyug",
            "tenant_name": "goodup-demo",
            "activity_id": "7"
          },
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "risk_score": 20,
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "payment_intent": "pi_1Ek5PlK7fTZ9PRZUBcDlZAZj",
          "payment_method": "pm_1Ek5PtK7fTZ9PRZUSCcZu2OM",
          "payment_method_details": {
            "card": {
              "brand": "visa",
              "checks": {
                "address_line1_check": null,
                "address_postal_code_check": "pass",
                "cvc_check": "pass"
              },
              "country": "US",
              "exp_month": 4,
              "exp_year": 2024,
              "fingerprint": "k4n6EIJ489kTlbat",
              "funding": "credit",
              "last4": "4242",
              "three_d_secure": null,
              "wallet": null
            },
            "type": "card"
          },
          "receipt_email": null,
          "receipt_number": null,
          "receipt_url": "https://pay.stripe.com/receipts/acct_1DVbSyK7fTZ9PRZU/ch_1Ek5PtK7fTZ9PRZUEYBqXYLa/rcpt_FEYW4iPGJO9oXtl8g12KoxteBIugwPL",
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [
            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_1Ek5PtK7fTZ9PRZUEYBqXYLa/refunds"
          },
          "review": null,
          "shipping": null,
          "source": null,
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer_data": null,
          "transfer_group": null
        }
      ],
      "has_more": false,
      "total_count": 1,
      "url": "/v1/charges?payment_intent=pi_1Ek5PlK7fTZ9PRZUBcDlZAZj"
    },
    "client_secret": "pi_1Ek5PlK7fTZ9PRZUBcDlZAZj_secret_pAiGjzuR13zDFbybuM4hea0gF",
    "confirmation_method": "automatic",
    "created": 1560241989,
    "currency": "eur",
    "customer": null,
    "description": null,
    "invoice": null,
    "last_payment_error": null,
    "livemode": false,
    "metadata": {
      "tenant_domain": "goodup-demo.localhost",
      "activity_title": "iyughyiugiyug",
      "tenant_name": "goodup-demo",
      "activity_id": "7"
    },
    "next_action": null,
    "next_source_action": null,
    "on_behalf_of": null,
    "payment_method": "pm_1Ek5PtK7fTZ9PRZUSCcZu2OM",
    "payment_method_types": [
      "card"
    ],
    "receipt_email": null,
    "review": null,
    "shipping": null,
    "source": null,
    "statement_descriptor": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
  }
}
